# PromptForFamilyInstancePlacementOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PromptForFamilyInstancePlacementOptions Constructor
PromptForFamilyInstancePlacementOptions Class See Also
---
Creates a new PromptForFamilyInstancePlacementOptions using default options.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public PromptForFamilyInstancePlacementOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
PromptForFamilyInstancePlacementOptions()
```

# See Also
PromptForFamilyInstancePlacementOptions Class
PromptForFamilyInstancePlacementOptions Overload
Autodesk.Revit.UI Namespace